; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		d t a i n s b r p - block
	)
	(:init
		(handempty)
		(clear d)
		(on d t)
		(ontable t)
		(clear s)
		(on s n)
		(on n a)
		(ontable a)
		(clear b)
		(on b p)
		(on p i)
		(on i r)
		(ontable r)
	)
	(:goal (and
		;; drains
		(clear d) (ontable s) (on d r) (on r a) (on a i) (on i n) (on n s)
	))
)

; plan
1. (unstack s n)
   deleted: (clear s) (handempty) (on s n)
   added: (holding s) (clear n)
   goals met: 1 of 7
2. (put-down s)
   deleted: (holding s)
   added: (clear s) (handempty) (ontable s)
   goals met: 2 of 7
3. (unstack n a)
   deleted: (clear n) (handempty) (on n a)
   added: (holding n) (clear a)
   goals met: 2 of 7
4. (stack n s)
   deleted: (holding n) (clear s)
   added: (clear n) (handempty) (on n s)
   goals met: 3 of 7
5. (unstack b p)
   deleted: (clear b) (handempty) (on b p)
   added: (holding b) (clear p)
   goals met: 3 of 7
6. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 3 of 7
7. (unstack p i)
   deleted: (clear p) (handempty) (on p i)
   added: (holding p) (clear i)
   goals met: 3 of 7
8. (put-down p)
   deleted: (holding p)
   added: (clear p) (handempty) (ontable p)
   goals met: 3 of 7
9. (unstack i r)
   deleted: (clear i) (handempty) (on i r)
   added: (holding i) (clear r)
   goals met: 3 of 7
10. (stack i n)
   deleted: (holding i) (clear n)
   added: (clear i) (handempty) (on i n)
   goals met: 4 of 7
11. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 4 of 7
12. (stack a i)
   deleted: (holding a) (clear i)
   added: (clear a) (handempty) (on a i)
   goals met: 5 of 7
13. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 5 of 7
14. (stack r a)
   deleted: (holding r) (clear a)
   added: (clear r) (handempty) (on r a)
   goals met: 6 of 7
15. (unstack d t)
   deleted: (clear d) (handempty) (on d t)
   added: (holding d) (clear t)
   goals met: 5 of 7
16. (stack d r)
   deleted: (holding d) (clear r)
   added: (clear d) (handempty) (on d r)
   goals met: 7 of 7
